
/*
 * エンチャント可能・不可のテストを行う
 *
 *
 */

// 釣竿
// スマッシュの両手剣補正はない
// OK 武器ES
// OK デッドリー(両手)
// NG マングース(両手) OK になってそう
// NG フェネック(両手) => OK になった？
// OK 黄玉(鉄)
// OK 精密な(武器)

// Lロッド
// NG デバイド

// ツルハシ
// OK デバイド

// ウッドプレートキャノン
// OK ウッドニードル
// グローブ
// NG 平和
// NG 害
// OK ハード(鉄)

// キルステン
// OK ハード(鉄)

// ボーンマリン(鎧以外)
// OK ハード

// ボーンマリン(鎧)
// NG ハード

// 弓
// ウッドニードル

// 裁縫キット
// OK レイヴンサマナー(右手・両手)
// NG 精密な(武器)

// 楽器
// OK レイヴンサマナー

// キッチンナイフ
// OK レイヴンサマナー

// 万能おたま
// OK レイヴンサマナー


// ガーディアングローブ
// OK 銀キツネ(鉄)
// OK 豊富な(手袋)

// コレス忍者グローブ
// OK 銀キツネ(鉄)
// OK 豊富な

同じ武器のみの「」は裁縫キットには貼り付けられない。 同じ「武器にエンチャント可能」の表記でも「Weapon(武器)」と「右手でもてるもの」の2種類があるようですね。釣竿はまた特殊みたいだけど(精密なが貼り付けられる)。

// ショートボウに木の針は貼れる?
// Wiki には貼れないと書いてあるが
// ググルと 木の針 ショートボウがでてくる

// 鋼鉄針、ウッドプレートキャノンに貼れるんじゃない?

// 手袋